.. _pesel_userguide:

PESEL Strings
============

Introduction
------------

The function :func:`clean_pl_pesel() <dataprep.clean.clean_pl_pesel.clean_pl_pesel>` cleans a column containing Polish national identification number (PESEL) strings, and standardizes them in a given format. The function :func:`validate_pl_pesel() <dataprep.clean.clean_pl_pesel.validate_pl_pesel>` validates either a single PESEL strings, a column of PESEL strings or a DataFrame of PESEL strings, returning `True` if the value is valid, and `False` otherwise.

PESEL strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "44051401359"
* `standard`: PESEL strings with proper whitespace in the proper places. Note that in the case of PESEL, the compact format is the same as the standard one.
* `birthdate`: split the date parts from the number and return the birth date, like "1944-05-14".
* `gender`: get the person's birth gender ('M' or 'F').

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_pl_pesel()` and `validate_pl_pesel()`.

### An example dataset containing PESEL strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "pesel": [
            "44051401359",
            "44051401358",
            '7542011030',
            '7552A10004', 
            '8019010008',
            "hello",
            np.nan,
            "NULL",
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "1111 S Figueroa St, Los Angeles, CA 90015",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

         pesel                                           address
0  44051401359                                     123 Pine Ave.
1  44051401358                                           main st
2   7542011030                      1234 west main heights 57033
3   7552A10004                    apt 1 789 s maple rd manhattan
4   8019010008                robie house, 789 north main street
5        hello         1111 S Figueroa St, Los Angeles, CA 90015
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles
7         NULL                                             hello

## 1. Default `clean_pl_pesel`

By default, `clean_pl_pesel` will clean pesel strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_pl_pesel
clean_pl_pesel(df, column = "pesel")

         pesel                                           address  pesel_clean
0  44051401359                                     123 Pine Ave.  44051401359
1  44051401358                                           main st          NaN
2   7542011030                      1234 west main heights 57033          NaN
3   7552A10004                    apt 1 789 s maple rd manhattan          NaN
4   8019010008                robie house, 789 north main street          NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015          NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles          NaN
7         NULL                                             hello          NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_pl_pesel(df, column = "pesel", output_format="standard")

         pesel                                           address  pesel_clean
0  44051401359                                     123 Pine Ave.  44051401359
1  44051401358                                           main st          NaN
2   7542011030                      1234 west main heights 57033          NaN
3   7552A10004                    apt 1 789 s maple rd manhattan          NaN
4   8019010008                robie house, 789 north main street          NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015          NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles          NaN
7         NULL                                             hello          NaN

### `compact`

In [4]:
clean_pl_pesel(df, column = "pesel", output_format="compact")

         pesel                                           address  pesel_clean
0  44051401359                                     123 Pine Ave.  44051401359
1  44051401358                                           main st          NaN
2   7542011030                      1234 west main heights 57033          NaN
3   7552A10004                    apt 1 789 s maple rd manhattan          NaN
4   8019010008                robie house, 789 north main street          NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015          NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles          NaN
7         NULL                                             hello          NaN

### `birthdate`

In [5]:
clean_pl_pesel(df, column = "pesel", output_format="birthdate")

         pesel                                           address pesel_clean
0  44051401359                                     123 Pine Ave.  1944-05-14
1  44051401358                                           main st         NaN
2   7542011030                      1234 west main heights 57033         NaN
3   7552A10004                    apt 1 789 s maple rd manhattan         NaN
4   8019010008                robie house, 789 north main street         NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015         NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles         NaN
7         NULL                                             hello         NaN

### `gender`

In [6]:
clean_pl_pesel(df, column = "pesel", output_format="gender")

         pesel                                           address pesel_clean
0  44051401359                                     123 Pine Ave.           M
1  44051401358                                           main st         NaN
2   7542011030                      1234 west main heights 57033         NaN
3   7552A10004                    apt 1 789 s maple rd manhattan         NaN
4   8019010008                robie house, 789 north main street         NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015         NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles         NaN
7         NULL                                             hello         NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned PESEL strings is added with a title in the format `"{original title}_clean"`.

In [7]:
clean_pl_pesel(df, column="pesel", inplace=True)

   pesel_clean                                           address
0  44051401359                                     123 Pine Ave.
1          NaN                                           main st
2          NaN                      1234 west main heights 57033
3          NaN                    apt 1 789 s maple rd manhattan
4          NaN                robie house, 789 north main street
5          NaN         1111 S Figueroa St, Los Angeles, CA 90015
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles
7          NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [8]:
clean_pl_pesel(df, "pesel", errors="coerce")

         pesel                                           address  pesel_clean
0  44051401359                                     123 Pine Ave.  44051401359
1  44051401358                                           main st          NaN
2   7542011030                      1234 west main heights 57033          NaN
3   7552A10004                    apt 1 789 s maple rd manhattan          NaN
4   8019010008                robie house, 789 north main street          NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015          NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles          NaN
7         NULL                                             hello          NaN

### `ignore`

In [9]:
clean_pl_pesel(df, "pesel", errors="ignore")

         pesel                                           address  pesel_clean
0  44051401359                                     123 Pine Ave.  44051401359
1  44051401358                                           main st  44051401358
2   7542011030                      1234 west main heights 57033   7542011030
3   7552A10004                    apt 1 789 s maple rd manhattan   7552A10004
4   8019010008                robie house, 789 north main street   8019010008
5        hello         1111 S Figueroa St, Los Angeles, CA 90015        hello
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles          NaN
7         NULL                                             hello          NaN

## 4. `validate_pl_pesel()`

`validate_pl_pesel()` returns `True` when the input is a valid PESEL. Otherwise it returns `False`.

The input of `validate_pl_pesel()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_pl_pesel()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_pl_pesel()` returns the validation result for the whole DataFrame.

In [10]:
from dataprep.clean import validate_pl_pesel
print(validate_pl_pesel('44051401359'))
print(validate_pl_pesel('44051401358'))
print(validate_pl_pesel('7542011030'))
print(validate_pl_pesel('7552A10004'))
print(validate_pl_pesel('8019010008'))
print(validate_pl_pesel("hello"))
print(validate_pl_pesel(np.nan))
print(validate_pl_pesel("NULL"))

True
False
False
False
False
False
False
False

### Series

In [11]:
validate_pl_pesel(df["pesel"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: pesel, dtype: bool

### DataFrame + Specify Column

In [12]:
validate_pl_pesel(df, column="pesel")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: pesel, dtype: bool

### Only DataFrame

In [13]:
validate_pl_pesel(df)

   pesel  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False
7  False    False